texto=Em 1991, na Sun Microsystems, foi iniciado o Green Project, o ber\u00E7o do Java, uma linguagem de programa\u00E7\u00E3o orientada a objetos. Os mentores do projeto eram Patrick Naughton, Mike Sheridan, e James Gosling. O objetivo do projeto n\u00E3o era a cria\u00E7\u00E3o de uma nova linguagem de programa\u00E7\u00E3o, mas antecipar e planejar a \u201Cpr\u00F3xima onda\u201D do mundo digital. Eles acreditavam que, em algum tempo, haveria uma converg\u00EAncia dos computadores com os equipamentos e eletrodom\u00E9sticos comumente usados pelas pessoas no seu dia-a-dia. Para provar a viabilidade desta ideia, 13 pessoas trabalharam arduamente durante 18 meses. No ver\u00E3o de 1992 eles emergiram de um escrit\u00F3rio de Sand Hill Road, no Menlo Park, com uma demonstra\u00E7\u00E3o funcional da ideia inicial. O prot\u00F3tipo se chamava *7 (l\u00EA-se \u201CStarSeven\u201D), um controle remoto com uma interface gr\u00E1fica touchscreen. Para o *7, foi criado um mascote, hoje amplamente conhecido no mundo Java, o Duke. O trabalho do Duke no *7 era ser um guia virtual ajudando e ensinando o usu\u00E1rio a utilizar o equipamento. O *7 tinha a habilidade de controlar diversos dispositivos e aplica\u00E7\u00F5es. James Gosling especificou uma nova linguagem de programa\u00E7\u00E3o para o *7. Gosling decidiu batiz\u00E1-la de \u201COak\u201D, que quer dizer carvalho, uma \u00E1rvore que ele podia observar quando olhava pela sua janela. O pr\u00F3ximo passo era encontrar um mercado para o *7. A equipe achava que uma boa ideia seria controlar televis\u00F5es e v\u00EDdeo por demanda com o equipamento. Eles constru\u00EDram uma demonstra\u00E7\u00E3o chamada de MovieWood, mas infelizmente era muito cedo para que o v\u00EDdeo por demanda bem como as empresas de TV a cabo pudessem viabilizar o neg\u00F3cio. A ideia que o *7 tentava vender, hoje j\u00E1 \u00E9 realidade em programas interativos e tamb\u00E9m na televis\u00E3o digital. Permitir ao telespectador interagir com a emissora e com a programa\u00E7\u00E3o em uma grande rede de cabos, era algo muito vision\u00E1rio e estava muito longe do que as empresas de TV a cabo tinham capacidade de entender e comprar. A ideia certa, na \u00E9poca errada. Entretanto, o estouro da internet aconteceu e rapidamente uma grande rede interativa estava se estabelecendo. Era este tipo de rede interativa que a equipe do *7 estava tentando vender para as empresas de TV a cabo. E, da noite para o dia, n\u00E3o era mais necess\u00E1rio construir a infra-estrutura para a rede, ela simplesmente estava l\u00E1. Gosling foi incumbido de adaptar o Oak para a internet e em janeiro 1995 foi lan\u00E7ada uma nova vers\u00E3o do Oak que foi rebatizada para Java. A tecnologia Java tinha sido projetada para se mover por meio das redes de dispositivos heterog\u00EAneos, redes como a internet. Agora aplica\u00E7\u00F5es poderiam ser executadas dentro dos navegadores nos Applets Java e tudo seria disponibilizado pela internet instantaneamente. Foi o est\u00E1tico HTML dos navegadores que promoveu a r\u00E1pida dissemina\u00E7\u00E3o da din\u00E2mica tecnologia Java. A velocidade dos acontecimentos seguintes foi assustadora, o n\u00FAmero de usu\u00E1rios cresceu rapidamente, grandes fornecedores de tecnologia, como a IBM anunciaram suporte para a tecnologia Java. Desde seu lan\u00E7amento, em maio de 1995, a plataforma Java foi adotada mais rapidamente do que qualquer outra linguagem de programa\u00E7\u00E3o na hist\u00F3ria da computa\u00E7\u00E3o. Em 2004 Java atingiu a marca de 3 milh\u00F5es de desenvolvedores em todo mundo. Java continuou crescendo e hoje \u00E9 uma refer\u00EAncia no mercado de desenvolvimento de software. Java tornou-se popular pelo seu uso na internet e hoje possui seu ambiente de execu\u00E7\u00E3o presente em navegadores, mainframes, sistemas operacionais, celulares, palmtops, cart\u00F5es inteligentes etc.
empresa=LBCA Advogados.
treinamento=Java SE 7 Fundamentals.